# LEET CODE
## Problem-176: Second Highest Salary
Class: Medium

Source: https://leetcode.com/problems/second-highest-salary

## Description
Table: Employee
| Column Name | Type |
|-------------|------|
| id          | int  |
| salary      | int  |

id is the primary key (column with unique values) for this table.

Each row of this table contains information about the salary of an employee.
 
## To Do
Write a solution to find the second highest salary from the Employee table. 

If there is no second highest salary, return null (return None in Pandas).

The result format is in the following example.

## Example
### Example 1:

Input: 

Employee table:
| id | salary |
|----|--------|
| 1  | 100    |
| 2  | 200    |
| 3  | 300    |

Output: 
| SecondHighestSalary |
|---------------------|
| 200                 |

### Example 2:

Input: 

Employee table:
| id | salary |
|----|--------|
| 1  | 100    |

Output: 
| SecondHighestSalary |
|---------------------|
| null                |

## Importing

In [1]:
import pandas as pd
from pandasql import sqldf

## Define Schema

In [2]:
data = [[1, 100], [2, 200], [3, 300]]
Employee = pd.DataFrame(data, columns=['id', 'salary']).astype({'id':'int64', 'salary':'int64'})

Employee

   id  salary
0   1     100
1   2     200
2   3     300

## Task

In [3]:
# Define the SQL query
query = """
SELECT ifnull(
  (SELECT distinct(salary)
  FROM Employee
  ORDER BY salary DESC
  LIMIT 1 OFFSET 1),
  NULL)
  AS SecondHighestSalary
;
"""

# Excute the query using pandasql
result = sqldf(query, env={'Employee':Employee})

# Display the result dataframe
display(result)

   SecondHighestSalary
0                  200